#+TITLE: Démarrer avec Helm
#+AUTHOR: Dominique Dumont
#+EMAIL: dominique@code-straight.fr
#+OPTIONS: timestamp:nil creator:nil author:nil num:nil toc:nil

# doc: https://github.com/yjwen/org-reveal/ and https://revealjs.com/

#+REVEAL_EXTRA_CSS: ./pres.css

#+REVEAL_THEME: solarized

# Available transitions are: default|cube|page|concave|zoom|linear|fade|none.
#+REVEAL_INIT_OPTIONS: transition: 'none', pdfSeparateFragments: false

** Chercher un paquet en CLI

#+BEGIN_SRC shell :results verbatim :exports both
helm search hub vault
#+END_SRC

#+RESULTS:
: URL                                               	CHART VERSION	APP VERSION	DESCRIPTION                                       
: https://hub.helm.sh/charts/wener/vault            	0.9.0        	1.6.1      	Official HashiCorp Vault Chart                    
: https://hub.helm.sh/charts/hashicorp/vault        	0.9.0        	1.6.1      	Official HashiCorp Vault Chart                    
: https://hub.helm.sh/charts/banzaicloud-stable/v...	1.10.0       	1.10.0     	A Helm chart for Vault, a tool for managing sec...


